There are no duct fittings defined in project. The default duct type for fittings will be set to none.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoDuctFittingsInProject { get; }
  Visual Basic
Public Shared ReadOnly Property NoDuctFittingsInProject As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoDuctFittingsInProject {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DuctFailures Class
  Autodesk.Revit.DB Namespace